Core/src/src/Catalogs/ПодключаемоеОборудование/ПодключаемоеОборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодключаемоеОборудование</name>
  <attributes>
    <name>ТипОборудования</name>
    <type>
      <types>EnumRef.ТипыПодключаемогоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторУстройства</name>
    <comment>Уникальный идентификатор устройства стандарта оборудования</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УстройствоИспользуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДрайверОборудования</name>
    <type>
      <types>CatalogRef.ДрайверыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>Параметры</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПереустановка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяУстановка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОбработчикДрайвера</name>
    <type>
      <types>EnumRef.ОбработчикиДрайверовПодключаемогоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторWebСервисОборудования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияФорматаОбмена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоОбмена</name>
    <comment>Предназначен для обмена с оборудованием Offline</comment>
    <type>
      <types>CatalogRef.ПравилаОбменаСПодключаемымОборудованиемOffline</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелИнформационнойБазы</name>
    <comment>Предназначен для обмена с оборудованием Offline</comment>
    <type>
      <types>ExchangePlanRef.ОбменСПодключаемымОборудованиемOffline</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.ОрганизацияБПО</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыРегистрации</name>
    <attributes>
      <name>НаименованиеПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/src/CommonForms/ФормаНастройкиTransLinkRESTAPIсинхЭквайринговыеТерминалы/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест"
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	Параметры.Свойство("Идентификатор", Идентификатор);
	Параметры.Свойство("ДрайверОборудования", ДрайверОборудования);
	Заголовок = НСтр("ka='ДП';ru='ДП'") + " """ + Строка(Идентификатор) + """";

	ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
	ЦветОшибки = ЦветаСтиля.ЦветОтрицательногоЧисла;

	Параметры.ПараметрыОборудования.Свойство("БанкТерминала"  , БанкТерминала);
	Параметры.ПараметрыОборудования.Свойство("ЗапретВозвратаЧастичнуюСуммуНаТерминале"  , ЗапретВозвратаЧастичнуюСуммуНаТерминале);
	Параметры.ПараметрыОборудования.Свойство("TerminalAlias"  , TerminalAlias);
	Параметры.ПараметрыОборудования.Свойство("ПечатьСлипНаТерминале"  , ПечатьСлипНаТерминале);
	
	//Малыщев 2024-07-19 ONESOFT-3343 (--
		
	КарточнаяТехника.Добавить("IsoTypeA");
	КарточнаяТехника.Добавить("IsoTypeB");
	КарточнаяТехника.Добавить("Mifare1K");
	КарточнаяТехника.Добавить("Mifare4K");
	КарточнаяТехника.Добавить("MifareUL");
	
	
	НосителиИсточникаТранзакций.Добавить("ManualEntry");
	НосителиИсточникаТранзакций.Добавить("MagnetSwipe");
	НосителиИсточникаТранзакций.Добавить("EmvChip");
	НосителиИсточникаТранзакций.Добавить("EmvContactless");
	НосителиИсточникаТранзакций.Добавить("EmvQRCPS");
	НосителиИсточникаТранзакций.Добавить("NFC");
	
	
	Параметры.ПараметрыОборудования.Свойство("licenseToken"  , licenseToken);
    Параметры.ПараметрыОборудования.Свойство("АдресСервера"  , АдресСервера);
	Параметры.ПараметрыОборудования.Свойство("ApiVersion"  , ApiVersion);
	
	Параметры.ПараметрыОборудования.Свойство("language"  , language);
	Параметры.ПараметрыОборудования.Свойство("idleText_LockDevice"  , idleText_LockDevice);
	Параметры.ПараметрыОборудования.Свойство("idleText_UnlockDevice"  , idleText_UnlockDevice);
	Параметры.ПараметрыОборудования.Свойство("operatorId"  , operatorId);
	Параметры.ПараметрыОборудования.Свойство("operatorName"  , operatorName);
	Параметры.ПараметрыОборудования.Свойство("silentCardRead"  , silentCardRead);
	Параметры.ПараметрыОборудования.Свойство("currencyCode"  , currencyCode);
	Параметры.ПараметрыОборудования.Свойство("Логировать"  , Логировать);
	Параметры.ПараметрыОборудования.Свойство("ПутьЛогирования"  , ПутьЛогирования);
	Параметры.ПараметрыОборудования.Свойство("Отладка"  , Отладка);
	Параметры.ПараметрыОборудования.Свойство("ГолосовоеОповещение"  , ГолосовоеОповещение);
	Параметры.ПараметрыОборудования.Свойство("СкрытьИзСпискаВыбора"  , СкрытьИзСпискаВыбора);
	Параметры.ПараметрыОборудования.Свойство("ВремяОжиданияКарты"  , ВремяОжиданияКарты);
	Параметры.ПараметрыОборудования.Свойство("ПредлагатьПовторитьОперациюОжидания"  , ПредлагатьПовторитьОперациюОжидания);
	
	//Карточная техника
	cardTechs = Новый Массив;
	Параметры.ПараметрыОборудования.Свойство("cardTechs"  , cardTechs);
	Если типЗнч(cardTechs)<>Тип("Массив") Тогда
		cardTechs = Новый Массив;	
	КонецЕсли;	
	КарточнаяТехникаВсе = cardTechs.Количество()=0;
	Для каждого Стр из cardTechs Цикл
		ИскомыйЭлемент = КарточнаяТехника.НайтиПоЗначению(Стр);
		Если ИскомыйЭлемент<>Неопределено ТОгда
			ИскомыйЭлемент.Пометка = Истина;
		КонецЕсли;	
	КонецЦикла;	

	//Носители источника транзакции
	enabledTranSourceMedias = Новый Массив;
	Параметры.ПараметрыОборудования.Свойство("enabledTranSourceMedias"  , enabledTranSourceMedias);
	Если типЗнч(enabledTranSourceMedias)<>Тип("Массив") Тогда
		enabledTranSourceMedias = Новый Массив;	
	КонецЕсли;	
	НосителиТранзакцийВсе = enabledTranSourceMedias.Количество()=0;
	Для каждого Стр из enabledTranSourceMedias Цикл
		ИскомыйЭлемент = НосителиИсточникаТранзакций.НайтиПоЗначению(Стр);
		Если ИскомыйЭлемент<>Неопределено ТОгда
			ИскомыйЭлемент.Пометка = Истина;
		КонецЕсли;	
	КонецЦикла;	
	
	
	//Малыщев 2024-07-19 ONESOFT-3343 --)
	
	
	Элементы.ТестУстройства.Видимость    = (ПараметрыСеанса.РабочееМестоКлиента
	                                        = Идентификатор.РабочееМесто);
	Элементы.УстановитьДрайвер.Видимость = Ложь; //(ПараметрыСеанса.РабочееМестоКлиента
	                                        //= Идентификатор.РабочееМесто);
											
	Если не ТолькоПросмотр и Не ЗначениеЗаполнено(language) Тогда
		
		ВремяОжиданияКарты = 30;
		
		Если Не ЗначениеЗаполнено(АдресСервера) ТОгда
			АдресСервера = "localhost:XXXX";
		КонецЕсли;	                         
		Если Не ЗначениеЗаполнено(ApiVersion) ТОгда
			ApiVersion = "v107";
		КонецЕсли;	                         
		Если Не ЗначениеЗаполнено(licenseToken) ТОгда
			licenseToken = "e034d5a6cf3212826c57f35cffb103905afe5936/f86419d06688b6336ddfe68dc00c214b9b83fb10";
		КонецЕсли;	                         
		Если Не ЗначениеЗаполнено(TerminalAlias) ТОгда
			TerminalAlias = "TerminalAlias";
		КонецЕсли;	                         
		
		Если Не ЗначениеЗаполнено(operatorId) ТОгда
			operatorId = "001";
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(operatorName) ТОгда
			operatorName = "Operator";	
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(language) ТОгда
			language = "EN";
		КонецЕсли;	                         
		
		Если Не ЗначениеЗаполнено(idleText_LockDevice) ТОгда
			idleText_LockDevice = "Welcome!!!";
		КонецЕсли;	                         
		Если Не ЗначениеЗаполнено(idleText_UnlockDevice) ТОгда
			idleText_UnlockDevice = "Be ready!!!";
		КонецЕсли;	                         
		
		Для Каждого Стр из КарточнаяТехника Цикл
			Стр.Пометка = Истина;
		КонецЦикла;	
		Для Каждого Стр из НосителиИсточникаТранзакций Цикл
			Стр.Пометка = Истина;
		КонецЦикла;	
		
	КонецЕсли;	
											
КонецПроцедуры

// Процедура - обработчик события "Перед открытием" формы.
//
// Параметры:
//  Отказ                - <Булево>
//                       - Признак отказа от открытия формы. Если в теле
//                         процедуры-обработчика установить данному параметру
//                         значение Истина, открытие формы выполнено не будет.
//                         Значение по умолчанию: Ложь 
//
//  СтандартнаяОбработка - <Булево>
//                       - В данный параметр передается признак выполнения
//                         стандартной (системной) обработки события. Если в
//                         теле процедуры-обработчика установить данному
//                         параметру значение Ложь, стандартная обработка
//                         события производиться не будет. Отказ от стандартной
//                         обработки не отменяет открытие формы.
//                         Значение по умолчанию: Истина 
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СписокЯзыков = TransLinkRESTAPI.ПолучитьСписокПоддерживаемыхЯзыков();
	Для Каждого КодЯзыка из СписокЯзыков Цикл
		Элементы.Язык.СписокВыбора.Добавить(КодЯзыка.Ключ,КодЯзыка.Значение);
	КонецЦикла;
	
	СписокВалют = TransLinkRESTAPI.ПолучитьСписокПоддерживаемыхВалют();
	Для Каждого КодВалюты из СписокВалют Цикл
		Элементы.currencyCode.СписокВыбора.Добавить(КодВалюты.Ключ,КодВалюты.Значение);
	КонецЦикла;
	
	ОбновитьИнформациюОДрайвере();
	
	УправлениеВидимостью();
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура МодельОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	//Наименование = Элементы.ТипВесов.СписокВыбора.НайтиПоЗначению(ВыбранноеЗначение).Представление;

КонецПроцедуры


&НаКлиенте
Процедура УправлениеВидимостью()
	
	Элементы.КарточнаяТехника.Доступность = не КарточнаяТехникаВсе;
	Если КарточнаяТехникаВсе Тогда
		Для каждого СтрЭлемент из КарточнаяТехника Цикл
			СтрЭлемент.Пометка = Истина;
		КонецЦикла;	
	КонецЕсли;	

	Элементы.НосителиИсточникаТранзакций.Доступность = не НосителиТранзакцийВсе;
	Если НосителиТранзакцийВсе Тогда
		Для каждого СтрЭлемент из НосителиИсточникаТранзакций Цикл
			СтрЭлемент.Пометка = Истина;
		КонецЦикла;	
	КонецЕсли;	
	
	Элементы.ПутьЛогирования.Доступность = Логировать;
	Элементы.idleText.КнопкаОткрытия= ГолосовоеОповещение;
	Элементы.idleText_LockDevice.КнопкаОткрытия= ГолосовоеОповещение;
	
КонецПроцедуры // УправлениеВидимостью()

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Процедура представляет обработчик события "Нажатие" кнопки
// "ОК" командной панели "ОсновныеДействияФормы".
//
// Параметры:
//  Кнопка - <КнопкаКоманднойПанели>
//         - Кнопка, с которой связано данное событие (кнопка "ОК").
//
&НаКлиенте
Процедура ЗаписатьИЗакрытьВыполнить()

	НовыеЗначениеПараметров = ПоместитьВсеПараметрыВСтруктуру();
	
	Результат = Новый Структура;
	Результат.Вставить("Идентификатор", Идентификатор);
	Результат.Вставить("ПараметрыОборудования", НовыеЗначениеПараметров);
	
	Закрыть(Результат);

КонецПроцедуры

&НаКлиенте
Функция ПоместитьВсеПараметрыВСтруктуру()
	
	НовыеЗначениеПараметров = Новый Структура;
	
	НовыеЗначениеПараметров.Вставить("Наименование"   , Наименование);
	НовыеЗначениеПараметров.Вставить("БанкТерминала"  , БанкТерминала);
	НовыеЗначениеПараметров.Вставить("ЗапретВозвратаЧастичнуюСуммуНаТерминале"  , ЗапретВозвратаЧастичнуюСуммуНаТерминале);
	НовыеЗначениеПараметров.Вставить("TerminalAlias"  , TerminalAlias);
	НовыеЗначениеПараметров.Вставить("ИспользоватьTranslinkДляТерминала"  , ИспользоватьTranslinkДляТерминала);
	НовыеЗначениеПараметров.Вставить("ПечатьСлипНаТерминале"  , ПечатьСлипНаТерминале);
	
	//Малышев 2024-07-19 ONESOFT-3343 (--
	НовыеЗначениеПараметров.Вставить("АдресСервера"  , АдресСервера);
	НовыеЗначениеПараметров.Вставить("licenseToken"  , licenseToken);
	НовыеЗначениеПараметров.Вставить("ЗащищенноеСоединение"  , ЗащищенноеСоединение);
	НовыеЗначениеПараметров.Вставить("ApiVersion"  , ApiVersion);
	
	НовыеЗначениеПараметров.Вставить("language"  , language);
	НовыеЗначениеПараметров.Вставить("idleText_LockDevice"  , idleText_LockDevice);
	НовыеЗначениеПараметров.Вставить("idleText_UnlockDevice"  , idleText_UnlockDevice);
	НовыеЗначениеПараметров.Вставить("operatorId"  , operatorId);
	НовыеЗначениеПараметров.Вставить("operatorName"  , operatorName);
	НовыеЗначениеПараметров.Вставить("silentCardRead"  , silentCardRead);
	НовыеЗначениеПараметров.Вставить("currencyCode"  , currencyCode);
	
	НовыеЗначениеПараметров.Вставить("Логировать"  , Логировать);
	НовыеЗначениеПараметров.Вставить("ПутьЛогирования"  , ПутьЛогирования);
	НовыеЗначениеПараметров.Вставить("Отладка"  , Отладка);
	НовыеЗначениеПараметров.Вставить("ГолосовоеОповещение"  , ГолосовоеОповещение);
	НовыеЗначениеПараметров.Вставить("СкрытьИзСпискаВыбора"  , СкрытьИзСпискаВыбора);
    НовыеЗначениеПараметров.Вставить("ВремяОжиданияКарты"  , ВремяОжиданияКарты);
    НовыеЗначениеПараметров.Вставить("ПредлагатьПовторитьОперациюОжидания"  , ПредлагатьПовторитьОперациюОжидания);
 	
	cardTechs = Новый Массив;
	Если не КарточнаяТехникаВсе ТОгда
		Для каждого СтрЭлемента из КарточнаяТехника Цикл
			Если СтрЭлемента.Пометка Тогда
				cardTechs.Добавить(СтрЭлемента.Значение);	
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
	НовыеЗначениеПараметров.Вставить("cardTechs"  , cardTechs);
	
	enabledTranSourceMedias = Новый Массив;
	Если не НосителиТранзакцийВсе Тогда
		Для каждого СтрЭлемента из НосителиИсточникаТранзакций Цикл
			Если СтрЭлемента.Пометка Тогда
				enabledTranSourceMedias.Добавить(СтрЭлемента.Значение);	
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
	НовыеЗначениеПараметров.Вставить("enabledTranSourceMedias"  , enabledTranSourceMedias);
	
	//Малышев 2024-07-19 ONESOFT-3343 --)

	Возврат НовыеЗначениеПараметров;
КонецФункции	


&НаКлиенте
Процедура УстановитьДрайвер(Команда)

	ОчиститьСообщения();
	
	ТекстСообщения = НСтр("ka='ამ კომუნიკაციის მეთოდისთვის დრაივერის ინსტალაცია არ არის საჭირო.';ru='Для данного способа связи устанавливать драйвер не требуется.'");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
 	
	ОбновитьИнформациюОДрайвере();

КонецПроцедуры

&НаКлиенте
Процедура ТестУстройства(Команда)

	РезультатТеста = Неопределено;

	ВходныеПараметры  = Неопределено;
	ВыходныеПараметры = Неопределено;
	
	времПараметрыУстройства = ПоместитьВсеПараметрыВСтруктуру();
	
	
	Результат = МенеджерОборудованияКлиент.ВыполнитьДополнительнуюКоманду("CheckHealth",
	                                                                      ВходныеПараметры,
	                                                                      ВыходныеПараметры,
	                                                                      Идентификатор,
	                                                                      времПараметрыУстройства);

	ДополнительноеОписание = ?(ТипЗнч(ВыходныеПараметры) = Тип("Массив")
	                           И ВыходныеПараметры.Количество(),
	                           НСтр("ka='დამატებითი აღწერილობა:';ru='Дополнительное описание:'") + " " + ВыходныеПараметры[1],
	                           "");
							   
							   
	Если Результат Тогда
		ТекстСообщения = НСтр("ka='ტესტი შესრულებულია წარმატებით.%ПереводСтроки%%ДополнительноеОписание%';ru='Тест успешно выполнен.%ПереводСтроки%%ДополнительноеОписание%'");
		
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПереводСтроки%", ?(ПустаяСтрока(ДополнительноеОписание),
		                                                                  "",
		                                                                  Символы.ПС));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ?(ПустаяСтрока(ДополнительноеОписание),
		                                                                           "",
		                                                                           ДополнительноеОписание));
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Иначе
		ТекстСообщения = НСтр("ka='ტესტი არ არის ჩაბარებული.%ПереводСтроки%%ДополнительноеОписание%';ru='Тест не пройден.%ПереводСтроки%%ДополнительноеОписание%'");
	
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПереводСтроки%", ?(ПустаяСтрока(ДополнительноеОписание),
		                                                                  "",
		                                                                  Символы.ПС));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ?(ПустаяСтрока(ДополнительноеОписание),
		                                                                           "",
		                                                                           ДополнительноеОписание));
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	РезультатТестирования = ТекстСообщения;						   
	ЭтаФорма.ТекущийЭлемент = Элементы.ГруппаРезультатТестирования;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ОбновитьИнформациюОДрайвере()

	ВходныеПараметры  = Неопределено;
	ВыходныеПараметры = Неопределено;

	времПараметрыУстройства = ПоместитьВсеПараметрыВСтруктуру();

	Если МенеджерОборудованияКлиент.ВыполнитьДополнительнуюКоманду("ПолучитьВерсиюДрайвера",
	                                                               ВходныеПараметры,
	                                                               ВыходныеПараметры,
	                                                               Идентификатор,
	                                                               времПараметрыУстройства) Тогда
		Если ВыходныеПараметры.Количество()>=2 Тогда														   
			Драйвер = ВыходныеПараметры[0];
			Версия  = ВыходныеПараметры[1];
		КонецЕсли;	
	Иначе
		Драйвер = ВыходныеПараметры[2];
		Версия  = НСтр("ka='არ არის განსაზღვრული';ru='Не определена'");
	КонецЕсли;

	Элементы.Драйвер.ЦветТекста = ?(Драйвер = НСтр("ka='არ არის დაყენებული';ru='Не установлен'"), ЦветОшибки, ЦветТекста);
	Элементы.Версия.ЦветТекста  = ?(Версия  = НСтр("ka='არ არის განსაზღვრული';ru='Не определена'"), ЦветОшибки, ЦветТекста);

	Элементы.УстановитьДрайвер.Доступность = Не (Драйвер = НСтр("ka='დაყენებულია';ru='Установлен'"));

КонецПроцедуры

&НаСервере
Функция ВозвратИсползованиеНесколькоЭквайринговыхТерминалов()
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	НастройкиРМКЭквайринговыеТерминалы.ЭквайринговыйТерминал,
	|	НастройкиРМКЭквайринговыеТерминалы.ПодключаемоеОборудование
	|ИЗ
	|	Справочник.НастройкиРМК.ЭквайринговыеТерминалы КАК НастройкиРМКЭквайринговыеТерминалы
	|ГДЕ
	|	НЕ НастройкиРМКЭквайринговыеТерминалы.ИспользоватьБезПодключенияОборудования
	|	И НЕ НастройкиРМКЭквайринговыеТерминалы.Ссылка.ПометкаУдаления
	|	И НастройкиРМКЭквайринговыеТерминалы.Ссылка.РабочееМесто = &РабочееМесто
	|
	|СГРУППИРОВАТЬ ПО
	|	НастройкиРМКЭквайринговыеТерминалы.ЭквайринговыйТерминал,
	|	НастройкиРМКЭквайринговыеТерминалы.ПодключаемоеОборудование";
	
	Запрос.УстановитьПараметр("РабочееМесто", МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента());
	Таб = Запрос.Выполнить().Выгрузить();
	
	Если Таб.Количество() > 1 Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции

&НаКлиенте
Процедура УстановитьДрайверAXConnect()
	
	//АдресZIPфайла = КаталогПрограммы() + "AXConnect.zip";
	//
	//Файл = Новый Файл(АдресZIPфайла);		
	//
	//СсылкаНаФайл = МенеджерОборудованияВызовСервера.ПолучитьМакетССервера("ДрайверBOG_AXConnect");
	//Результат = ПолучитьФайл(СсылкаНаФайл, АдресZIPфайла, Ложь);
	//			
	//ZIPфайл = Новый ЧтениеZipФайла(АдресZIPфайла);
	//ZIPфайл.ИзвлечьВсе(КаталогПрограммы());
	//
	//Если ИспользоватьTranslinkДляТерминала Тогда 
	//	ЗапуститьПриложение("regasm.exe AXCAddInLibrary.dll ",, Истина);
	//Иначе
	//	ЗапуститьПриложение("regasm.exe AXCBog.dll ",, Истина);
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьTranslinkДляТерминалаПриИзменении(Элемент)
	
	Элементы.TerminalAlias.Видимость = ИспользоватьTranslinkДляТерминала;
	
КонецПроцедуры


&НаКлиенте
Процедура КарточнаяТехникаВсеПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры


&НаКлиенте
Процедура НосителиТранзакцийВсеПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры


&НаКлиенте
Процедура ПутьЛогированияОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение("explorer.exe " + ПутьЛогирования);
КонецПроцедуры


&НаКлиенте
Процедура ПутьЛогированияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.МножественныйВыбор = Ложь;
	Если Диалог.Выбрать() ТОгда
		ПутьЛогирования = Диалог.Каталог;
		Модифицированность = Истина;
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура ЛогироватьПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры


&НаКлиенте
Процедура УправлениеЭТ(Команда)
	ОткрытьФорму("Справочник.ПодключаемоеОборудование.Форма.УправлениеЭквайринговымТерминалом");
КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьДокумент(Команда)

	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Сумма", 100);
	ПараметрыФормы.Вставить("ПределСуммы", 100);
	ПараметрыФормы.Вставить("УказатьДополнительныеДанные", Истина);
	ПараметрыФормы.Вставить("СписокТиповКарт", Новый СписокЗначений());
	Индекс = 0; 
	СписокКарт = ПолучитьСписокВидовКартТерминала(Идентификатор);
	Для каждого ВидКарты Из СписокКарт Цикл
		ПараметрыФормы.СписокТиповКарт.Добавить(Индекс, ВидКарты.Значение);
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Результат = Неопределено;
	НомерКарты = "";
	ИдентификаторУстройстваЭТ = Идентификатор;
	ИдентификаторУстройстваФР = Неопределено;
	
	ДополнительныеПараметры = Новый Структура(
		"ИдентификаторУстройстваФР, ИдентификаторУстройстваЭТ, НомерКарты",
		ИдентификаторУстройстваФР, ИдентификаторУстройстваЭТ, НомерКарты
		);
	
	ОписаниеЗавершения = Новый ОписаниеОповещения("ВыполнитьЗакрытиеДокумента_Завершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Справочник.ПодключаемоеОборудование.Форма.ФормаАвторизацииЭТ", ПараметрыФормы,,,,,ОписаниеЗавершения);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокВидовКартТерминала(ИдентификаторУстройстваЭТ)
	
	Результат = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Если Метаданные.Справочники.Найти("ЭквайринговыеТерминалы") <> Неопределено Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭквайринговыеТерминалыВидыПлатежныхКарт.ВидПлатежнойКарты КАК ВидПлатежнойКарты
		|ИЗ
		|	Справочник.ЭквайринговыеТерминалы.ВидыПлатежныхКарт КАК ЭквайринговыеТерминалыВидыПлатежныхКарт
		|ГДЕ
		|	ЭквайринговыеТерминалыВидыПлатежныхКарт.Ссылка.ПодключаемоеОборудование = &ПодключаемоеОборудование";
		Запрос.УстановитьПараметр("ПодключаемоеОборудование", ИдентификаторУстройстваЭТ);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Результат.Добавить(Выборка.ВидПлатежнойКарты);
		КонецЦикла;	                                      
	Иначе 
		Результат.Добавить(ИдентификаторУстройстваЭТ);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции // ПолучитьСписокКартТерминала()


&НаКлиенте
Процедура ВыполнитьЗакрытиеДокумента_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Результат.СсылочныйНомер = СокрЛП(Результат.СсылочныйНомер);
	Результат.НомерЧека = СокрЛП(Результат.НомерЧека);
	
	Если не ЗначениеЗаполнено(Результат.НомерЧека) Тогда
		Сообщить("Ошибка: Номер чека не заполнен");
		Возврат;
	КонецЕсли;	
	Если не ЗначениеЗаполнено(Результат.СсылочныйНомер) Тогда
		Сообщить("Ошибка: Ссылочный номер не заполнен");
		Возврат;
	КонецЕсли;	
	
	
	РезультатТеста = Неопределено;

	ВходныеПараметры  = Новый Структура("СсылочныйНомер, НомерЧека", Результат.СсылочныйНомер, Результат.НомерЧека);
	
	ВыходныеПараметры = Неопределено;
	
	времПараметрыУстройства = ПоместитьВсеПараметрыВСтруктуру();
	
	
	Результат = МенеджерОборудованияКлиент.ВыполнитьДополнительнуюКоманду("CloseDoc",
	                                                                      ВходныеПараметры,
	                                                                      ВыходныеПараметры,
	                                                                      Идентификатор,
	                                                                      времПараметрыУстройства);

	ДополнительноеОписание = ?(ТипЗнч(ВыходныеПараметры) = Тип("Массив")
	                           И ВыходныеПараметры.Количество(),
	                           НСтр("ka='დამატებითი აღწერილობა:';ru='Дополнительное описание:'") + " " + ВыходныеПараметры[1],
	                           "");
							   
							   
	Если Результат Тогда
		ТекстСообщения = НСтр("ka='დოკუმენტი წარმატებით დაიხურა';ru='Документ закрыт успешно.'");
		ПоказатьОповещениеПользователя("Закрыть документ",,ТекстСообщения,БиблиотекаКартинок.ОформлениеЗнакФлажок,СтатусОповещенияПользователя.Информация);	
		
	Иначе
		ТекстСообщения = НСтр("ka='დახურვა ვერ მოხერხდა';ru='Закрытие не выполнено.'");
	    ПоказатьОповещениеПользователя("Закрыть документ",,ТекстСообщения,БиблиотекаКартинок.ОформлениеЗнакКрест,СтатусОповещенияПользователя.Информация);	
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ГолосовоеОповещениеПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура idleTextОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	TransLinkRESTAPI.ПроизнестиФразу(idleText_UnlockDevice);
КонецПроцедуры

&НаКлиенте
Процедура idleText_LockDeviceОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	TransLinkRESTAPI.ПроизнестиФразу(idleText_LockDevice);
КонецПроцедуры
